{
  "basics": {
    "name": "Lewis Watson",
    "label": "Senior Software Engineer",
    "picture": "",
    "email": "mrlewiswatson@gmail.com",
    "phone": "",
    "website": "https://lewiswatson.co.uk",
    "summary": "Software Engineer with over 9 years of commercial experience spanning from cloud down to embedded real-time applications. Currently a Senior Application Developer at CGI's Open Digital Services Centre where we specialise in delivering solutions using open source technologies to Government and Industry.<p>In my spare time I explore interesting technologies and contribute to open source. See my Github profile for more info.",
    "location": {
      "countryCode": "GB",
      "region": "Scotland"
    },
    "profiles": [
      {
        "network": "linkedin",
        "username": "LewisWatson",
        "url": "https://uk.linkedin.com/in/lewiswatson"
      },
      {
        "network": "GitHub",
        "username": "LewisWatson",
        "url": "https://github.com/LewisWatson"
      }
    ]
  },
  "work": [
    {
      "company": "CGI - Open Digital Services Centre",
      "position": "Senior Software Engineer",
      "website": "http://www.cgi-group.co.uk/",
      "startDate": "2014-05-01",
      "summary": "One of the first hires to CGI's Open Digital Services Centre in Glasgow, which specialises in developing solutions around Open Source and Open Standards. I have been fortunate to be involved in helping to shape the processes and culture of the office, while involved with a number of customer projects, acting as project lead for two of them. I have also driven the adoption of open source development tools such as GitLab for source control, Taiga for project management and Mattermost for team collaboration.",
      "highlights": [
        "Currently Scrum Master and Senior Developer on a large public sector project, working on integrating a new external service in to the existing Service Orientated Architectue. Technologies used include JBoss Fuse ESB, Apache CXF, Apache ActiveMQ, Apache Camel, JBoss Drools BPMS.",
        "Senior Developer on a project developing an Enterprise Service Bus to connect an Automated Traffic Management System to roadside devices. I'm gaining experience with technologies such as Red Hat JBoss Fuse Integration Services, Red Hat Openshift Cloud, Kubernetes, Apache Camel, Apache ActiveMQ and JBoss Drools BPMS.",
        "Project lead on an agile scrum team who delivered a data analysis system for a public sector client. The system used ElasticSearch, Kibana, MongoDB, Docker, and some custom Java components.",
        "Project lead on a team using Kanban for a public sector client to modernise their web service infrastructure. We introduced a number of improvements including containerisation using Docker, automated monitoring with Nagios, an online issue tracker using Taiga, and formal documentation of processes and configuration.",
        "Senior developer on a remote agile scrum team developing Java components for a large public sector project. During this time I gained experience with Apache CXF, JBoss Fuse ESB, and JBoss Portal.",
        "Produced a number technology demonstrations to aid in attracting business to the centre. This involved technologies such as docker, database virtalization, MongoDB, JBoss Fuse Enterprise Service Bus, Open Data Geospatial systems, Hadoop, and Lumify big data analysis + visualisation platform.",
        "Career mentor for two Modern Apprentice Software Engineers."
      ]
    },
    {
      "company": "Thales UK",
      "position": "Software Engineer",
      "website": "https://www.thalesgroup.com",
      "startDate": "2007-06-01",
      "endDate": "2014-05-01",
      "summary": "Joined the Thales Graduate Development program straight from university and worked with them for 7 years. During this time I gained full stack development experience spanning web technologies (front-end and back-end) down to embedded application development. As part of the 4 year graduate development scheme I also benefitied from training that focused on soft skills such as project management, collaboration and presentation skills.",
      "highlights": [
        "Developed a web based inventory tracking system with a HTML5 user interface (ExtJS, jQuery, Bootstrap) served by a PHP/ASP backend connected to a MySQL database. My role also involved design, server configuration, replication, app deployment, and setting up a Continuous Integration environment for my team.",
        "Technical lead for a project developing an Engineering Resource Management system that automatically matched engineers to roles within the company. A key feature was the use of a business rules management system (BRMS) that enabled site administrators to change the applications business logic on the fly, allowing the system to rapidly adapt to changing priorities.",
        "Technical consultant for a team developing Windows C++ applications that used Nvidia CUDA to perform calculations on GPU's. I advised on best practice, converted the Visual Studio code to compile in GCC and install via the RPM Package Manager in Linux. I also designed and implemented an automated process for deploying the system into production devices via PXE network boot and a custom flavour of Fedora Linux.",
        "Developed a big data system designed to enable a major project to exploit large data sets more efficiently. I took on the roles of Software Architect, Developer, and Sysadmin in order to design, implement, and deploy a solution. The system incorporated C++ worker processes controlled via a HTML5 web app.",
        "Upgraded network interfaces on hard real-time embedded C application.",
        "I mentored a number of Year In Industry (YINI) and summer placement students."
      ]
    }
  ],
  "education": [
    {
      "institution": "Heriot-Watt University",
      "area": "Computer Science",
      "studyType": "Bsc Hons",
      "startDate": "2003-06-01",
      "endDate": "2007-06-01",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Red Hat",
      "area": "Professional Certifications",
      "startDate": "2016-01-01",
      "endDate": "2016-12-31",
      "courses": [
        "RedHat Certificate of Expertise in Camel Development"
      ]
    }
  ],
  "skills": [
    {
      "name": "Integration",
      "level": "",
      "keywords": [
        "JBoss Fuse ESB",
        "JBoss Fuse Integration Services",
        "ActiveMQ Messaging",
        "Apache Camel",
        "Drools BPMS",
        "Spring Framework"
      ]
    },
    {
      "name": "Web Services",
      "level": "",
      "keywords": [
        "REST",
        "SOAP",
        "{json:api}"
      ]
    },
    {
      "name": "Cloud",
      "level": "",
      "keywords": [
        "Azure",
        "Rackspace",
        "Kubernetes",
        "OpenShift"
      ]
    },
    {
      "name": "Data",
      "level": "",
      "keywords": [
        "PostgreSQL",
        "MongoDB",
        "MariaDB/MySQL",
        "Microsoft SQL Server",
        "ElasticSearch"
      ]
    },
    {
      "name": "Build Chains",
      "level": "",
      "keywords": [
        "Apache Maven",
        "MsBuild",
        "Apache Ant",
        "Jenkins",
        "GNU Make"
      ]
    },
    {
      "name": "Backend Languages",
      "level": "",
      "keywords": [
        "Java",
        "Go",
        "C/C++",
        "Python"
      ]
    },
    {
      "name": "Web Development",
      "level": "",
      "keywords": [
        "Angular2",
        "ExtJS",
        "Bootstrap"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Technology",
      "keywords": [
        "Kubernetes",
        "Cloud",
        "Golang",
        "Progressive Web Applications",
        "Open Source / Open Standards",
        "Novel uses of web technologies (e.g. NodeJS and Electron)"
      ]
    },
    {
      "name": "Side Projects",
      "keywords": [
        "Open Source Car Share Tracker (see GitHub)",
        "My combination Workshop/Home Office/Shed"
      ]
    }
  ],
  "references": []
}
